---
type: SelectionUIOptions
namespace: Autodesk.Revit.UI
version: 2024
members: 10
tags: [revit-api, class]
---

# SelectionUIOptions

`Autodesk.Revit.UI.SelectionUIOptions` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | ElementSelectsAsPinned | 2016 | `public static bool ElementSelectsAsPinned ( Document document , Element element )` |
| Method | GetSelectionUIOptions | 2016 | `public static SelectionUIOptions GetSelectionUIOptions ()` |
| Property | ActivateControlsAndDimensionsOnMultiSelect | 2016 | `public bool ActivateControlsAndDimensionsOnMultiSelect { get ; set ; }` |
| Property | DragOnSelection | 2016 | `public bool DragOnSelection { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | SelectFaces | 2016 | `public bool SelectFaces { get ; set ; }` |
| Property | SelectLinks | 2016 | `public bool SelectLinks { get ; set ; }` |
| Property | SelectPinned | 2016 | `public bool SelectPinned { get ; set ; }` |
| Property | SelectUnderlay | 2016 | `public bool SelectUnderlay { get ; set ; }` |